{
  "backend/main.mo": "Main Motoko canister implementing pricing plans, site settings, reviews, user profiles, admin authorization, and storage logic.",
  "backend/migration.mo": "Stub migration module returning a new actor state with no transformation.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of human‑written summaries for all frontend source files.",
  "frontend/.env.example": "Template environment configuration for frontend development and deployment.",
  "frontend/DEPLOYMENT.md": "Guide outlining prerequisites and steps for deploying the app to IC mainnet.",
  "frontend/index.css": "Global Tailwind CSS setup defining base styles and theming variables.",
  "frontend/index.html": "HTML entry point containing the root element and script loader.",
  "frontend/scripts/deploy-ic.sh": "Shell script automating IC mainnet deployment, environment checks, and canister deployment.",
  "frontend/scripts/verify-deploy.sh": "Shell script that verifies deployed canisters, checks their running status, and confirms frontend accessibility.",
  "frontend/src/App.tsx": "Main app component rendering the LandingPage.",
  "frontend/src/components/admin/AdminAccessDenied.tsx": "UI modal informing users they lack admin access, with different messages depending on whether admins already exist.",
  "frontend/src/components/admin/AdminPanel.tsx": "Main admin control panel with tabs for pricing, content, logo, and admin management.",
  "frontend/src/components/admin/AdminsAdminPanel.tsx": "Admin management UI for listing, adding, and removing admin principals with validation and alerts.",
  "frontend/src/components/admin/AdminSetupDialog.tsx": "Dialog allowing the first user to claim admin rights with success and error handling.",
  "frontend/src/components/admin/LogoAdminPanel.tsx": "Panel for viewing and updating the site logo, including file validation, preview, and upload progress.",
  "frontend/src/components/admin/PricingPlansAdminPanel.tsx": "Admin panel for listing, creating, editing, and deleting pricing plans with form validation and modal dialogs.",
  "frontend/src/components/admin/SiteCustomizationAdminPanel.tsx": "Form-based admin panel for editing site text and settings, with load, save, and error/success handling.",
  "frontend/src/components/landing/Footer.tsx": "Footer component rendering branding, navigation links, social icons, and dynamic site settings.",
  "frontend/src/components/landing/Header.tsx": "Header with logo, navigation, authentication logic, admin checks, and responsive mobile menu.",
  "frontend/src/components/landing/Hero.tsx": "Hero section using site settings for text and CTAs with scroll-based reveal animations.",
  "frontend/src/components/landing/ScrollReveal.tsx": "Utility component that reveals its children with a fade/slide animation when scrolled into view.",
  "frontend/src/components/landing/Sections.tsx": "Defines landing page sections including stats, features, and pricing, pulling data from siteCopy and backend queries with animated cards and layout components.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Displays a mandatory setup dialog for new authenticated users to submit their name and save an initial profile.",
  "frontend/src/components/profile/UserProfileDialog.tsx": "Provides a dialog for viewing and updating an existing user profile with success and error handling.",
  "frontend/src/content/siteCopy.ts": "Contains static marketing copy for navigation, hero content, stats, features, pricing, and reviews.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, exposing identity state, login, logout, and provider setup logic.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for admin checks, admin bootstrap, and fetching admin lists using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light/dark theming.",
  "frontend/src/main.tsx": "Bootstraps the React app using React Query and Internet Identity providers.",
  "frontend/src/pages/LandingPage.tsx": "Renders the main landing page and conditionally shows the admin panel based on authentication and admin status.",
  "frontend/src/utils/siteSettings.ts": "Merges backend site settings with frontend defaults to produce final UI copy values.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them to sessionStorage, and cleaning hash params.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens, animations, and plugin setup.",
  "project_state.json": "Stores project metadata, requirements, issues, and architectural notes for the Tripple Host website."
}