{
  "backend/main.mo": "IC backend actor defining pricing plans, user profiles, site settings, admin authorization, and blob storage with CRUD for pricing plans.",
  "feature_evidence.json": "Feature evidence report mapping features to modified files, components, and test IDs for deployment and verification improvements.",
  "frontend-file-summaries.txt": "Text file containing summarized descriptions of all frontend components, hooks, utilities, and admin panels.",
  "frontend/.env.example": "Template environment configuration for local and mainnet builds specifying DFX network and Internet Identity URL.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining prerequisites, environment setup, and steps for deploying the app to IC mainnet.",
  "frontend/index.css": "Global stylesheet defining Tailwind layers and OKLCH-based color variables for light and dark themes.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx.",
  "frontend/scripts/deploy-ic.sh": "Mainnet deployment script that validates environment, builds the frontend, creates canisters, and deploys to IC with clear output.",
  "frontend/scripts/verify-deploy.sh": "Bash script that verifies IC canister deployment, checks canister status, and confirms frontend accessibility.",
  "frontend/src/App.tsx": "Root React component that renders the LandingPage.",
  "frontend/src/components/admin/AdminAccessDenied.tsx": "UI overlay explaining lack of admin access, with different messaging depending on whether admins exist.",
  "frontend/src/components/admin/AdminPanel.tsx": "Full-screen admin panel with tabs for pricing, content, logo, and admin management.",
  "frontend/src/components/admin/AdminsAdminPanel.tsx": "Admin management UI for listing, adding, removing, and copying administrator principals.",
  "frontend/src/components/admin/AdminSetupDialog.tsx": "Dialog allowing the first user to claim admin access, with success and error handling.",
  "frontend/src/components/admin/LogoAdminPanel.tsx": "Panel for viewing, previewing, validating, and uploading a new site logo with progress tracking.",
  "frontend/src/components/admin/PricingPlansAdminPanel.tsx": "Admin interface for viewing, creating, editing, and deleting pricing plans with form validation and API mutations.",
  "frontend/src/components/admin/SiteCustomizationAdminPanel.tsx": "Form-based admin panel for editing site content settings and saving updates via backend API.",
  "frontend/src/components/landing/Footer.tsx": "Landing page footer displaying logo, navigation links, social icons, and dynamic site settings content.",
  "frontend/src/components/landing/Header.tsx": "Responsive header with logo, navigation, login/logout handling, and conditional admin setup or admin access buttons.",
  "frontend/src/components/landing/Hero.tsx": "Hero section showing dynamic site settings text, background visuals, CTAs, and feature highlights with scroll animations.",
  "frontend/src/components/landing/ScrollReveal.tsx": "Utility component that reveals children with a fade-and-slide animation when scrolled into view.",
  "frontend/src/components/landing/Sections.tsx": "Contains landing page components for stats, features, and pricing, pulling data from site copy and backend while rendering animated UI sections.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Displays a dialog prompting new authenticated users to enter their name and saves the profile via mutation.",
  "frontend/src/components/profile/UserProfileDialog.tsx": "Provides a modal for viewing and editing a user's profile name with success and error handling.",
  "frontend/src/content/siteCopy.ts": "Stores static marketing copy used across the landing page, including hero text, features, stats, pricing, and FAQ.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the authenticated identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, providing identity loading, login, logout, and status handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for admin checks, admin claiming, and admin list retrieval using the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables including light/dark mode color tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/LandingPage.tsx": "Landing page composition with sections and admin panel access logic based on authentication and admin status.",
  "frontend/src/utils/siteSettings.ts": "Merges backend site settings with frontend defaults to produce unified site configuration values.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins for the site's design system.",
  "project_state.json": "Records project version, requirements, architectural notes, issues, and feature tracking metadata."
}