{
  "backend/main.mo": "Motoko canister providing admin‑controlled CRUD for pricing plans plus user profile storage with AccessControl authorization.",
  "feature_evidence.json": "Feature evidence report listing two frontend modifications: renaming CTA labels and updating the Talk to Sales button behavior.",
  "frontend-file-summaries.txt": "Reference mapping of frontend file paths to brief descriptions used for documentation or build planning.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "HTML entry point mounting the root element and loading the main React module.",
  "frontend/src/App.tsx": "Root React component that renders the LandingPage.",
  "frontend/src/components/admin/PricingPlansAdminPanel.tsx": "Admin UI for creating, editing, and deleting pricing plans with validation and React Query mutations.",
  "frontend/src/components/landing/Footer.tsx": "Footer with branding, navigation links, social links, and caffeine.ai attribution.",
  "frontend/src/components/landing/Header.tsx": "Header with navigation, Internet Identity auth controls, admin access button, and mobile menu handling.",
  "frontend/src/components/landing/Hero.tsx": "Hero section with background image, animated reveal elements, CTA buttons, and feature icons using siteCopy content.",
  "frontend/src/components/landing/ScrollReveal.tsx": "Scroll-triggered animation wrapper using IntersectionObserver to fade and slide elements into view.",
  "frontend/src/components/landing/Sections.tsx": "Landing page sections for stats, features, and pricing, each using siteCopy content, ScrollReveal animations, and optional backend pricing data.",
  "frontend/src/content/siteCopy.ts": "Centralized static text and configuration for hero, navigation, stats, features, pricing, and FAQ content.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing a backend actor instance based on Internet Identity authentication, with automatic query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for admin checks, user profiles, and CRUD operations on pricing plans via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables for colors, radii, and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with react‑query and Internet Identity providers.",
  "frontend/src/pages/LandingPage.tsx": "Renders the full landing page layout and conditionally displays an admin panel based on authentication and admin status.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radii, shadows, animations, and plugins based on CSS variable–driven theming.",
  "project_state.json": "Stores project metadata, requirements, features, and current architectural notes for the Tripple Host site."
}