{
  "backend/main.mo": "Motoko backend implementing admin‑controlled CRUD for pricing plans and user profile storage with access control.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind CSS setup defining light/dark design tokens and base styles.",
  "frontend/index.html": "HTML entry file that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Root React component that renders the LandingPage.",
  "frontend/src/components/admin/PricingPlansAdminPanel.tsx": "Admin panel UI for creating, editing, and deleting pricing plans using React Query mutations.",
  "frontend/src/components/landing/Footer.tsx": "Footer with branding, navigation links, social icons, and caffeine.ai attribution.",
  "frontend/src/components/landing/Header.tsx": "Responsive header with navigation, Internet Identity auth controls, and conditional Admin button for admin users.",
  "frontend/src/components/landing/Hero.tsx": "Hero section with background image, animated reveals, and CTA buttons using siteCopy content.",
  "frontend/src/components/landing/ScrollReveal.tsx": "IntersectionObserver-based wrapper that fades and slides children into view with optional delay.",
  "frontend/src/components/landing/Sections.tsx": "Landing sections for stats, features, and pricing, using ScrollReveal and optional backend pricing data.",
  "frontend/src/content/siteCopy.ts": "Static text/content configuration for the landing page including hero, stats, features, pricing, and FAQ.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for handling Internet Identity login, state, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for admin checks, user profiles, and pricing plans using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive OKLCH design tokens for light and dark themes, applying global base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/LandingPage.tsx": "Renders the landing page layout and conditionally displays an admin panel based on authentication and admin status.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and persisting URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color tokens, animations, container settings, and plugins.",
  "project_state.json": "Describes the project’s state, requirements, features, and architectural notes for building the Tripple Host site."
}