{
  "backend/main.mo": "Motoko backend defining pricing plans, user profiles, site settings, admin authorization, and storage, including CRUD operations and admin-gated actions.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and tests with confidence levels.",
  "frontend-file-summaries.txt": "List of summarized descriptions for all major frontend files, including components, hooks, and admin panels.",
  "frontend/index.css": "Tailwind CSS base and theme variables defining light and dark mode color systems and global styling.",
  "frontend/index.html": "HTML entry point containing root div and script loading the main React application.",
  "frontend/src/App.tsx": "Root React component that renders the LandingPage.",
  "frontend/src/components/admin/AdminAccessDenied.tsx": "UI overlay showing context-aware admin access denial messaging with close action.",
  "frontend/src/components/admin/AdminPanel.tsx": "Unified admin interface with tabs for pricing, content customization, logo management, and admin management.",
  "frontend/src/components/admin/AdminsAdminPanel.tsx": "UI for listing, adding, removing, and copying admin principals with mutation and identity hooks.",
  "frontend/src/components/admin/AdminSetupDialog.tsx": "Dialog allowing first-time admin setup with claim logic, success feedback, and error handling.",
  "frontend/src/components/admin/LogoAdminPanel.tsx": "Allows uploading and previewing a new site logo with validation, progress tracking, and backend update.",
  "frontend/src/components/admin/PricingPlansAdminPanel.tsx": "Interface to create, edit, validate, and delete pricing plans using backend mutations.",
  "frontend/src/components/admin/SiteCustomizationAdminPanel.tsx": "Form-based editor for site content settings with loading, saving, and error handling.",
  "frontend/src/components/landing/Footer.tsx": "Renders site footer with dynamic logo, settings-driven text, navigation links, and social icons.",
  "frontend/src/components/landing/Header.tsx": "Landing page header with logo, navigation, authentication handling, admin checks, and mobile drawer menu.",
  "frontend/src/components/landing/Hero.tsx": "Hero section displaying dynamic titles, CTAs, background imagery, and feature badges with scroll-based animations.",
  "frontend/src/components/landing/ScrollReveal.tsx": "Utility component that reveals children with fade-and-slide animations when entering the viewport.",
  "frontend/src/components/landing/Sections.tsx": "Contains Stats, Features, and Pricing sections using site copy and backend data, each rendered with animations and UI components.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting newly authenticated users without a profile to submit their name and save it via a mutation.",
  "frontend/src/components/profile/UserProfileDialog.tsx": "Dialog allowing users to view and update their profile name with validation and success feedback.",
  "frontend/src/content/siteCopy.ts": "Static content definitions for navigation, hero, stats, features, pricing, and FAQ used throughout the landing page.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the user's identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, loading identities, handling login/logout, and providing context to the app.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for admin checks, admin management, and backend interactions using the actor.",
  "frontend/src/index.css": "Defines Tailwind base layers and theme variables for light and dark mode styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with InternetIdentityProvider and React Query configuration.",
  "frontend/src/pages/LandingPage.tsx": "Renders the landing page layout and conditionally shows admin panel access based on identity and admin status.",
  "frontend/src/utils/siteSettings.ts": "Merges backend site settings with default frontend copy to produce final UI configuration.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project state, feature requirements, issues, and architectural notes for building the customizable 'tripple host' website with admin and user authentication."
}