{
  "kind": "build_request",
  "title": "Fix missing Reviews visibility and restore reliable admin management experience",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-38",
      "text": "Ensure the Reviews (rating) section is discoverable from the main navigation by adding a visible navigation link to the existing landing-page Reviews section (id=\"reviews\") in both desktop and mobile header navigation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-15",
          "msg-16"
        ],
        "quotes": [
          "Where is rating thing and only 1 admin chamges",
          "Updat codss"
        ]
      },
      "acceptanceCriteria": [
        "On the landing page, the header navigation includes a \"Reviews\" link on desktop and in the mobile menu.",
        "Clicking the \"Reviews\" nav link scrolls/navigates to the existing Reviews section (#reviews).",
        "No user-facing navigation labels are hardcoded in Header.tsx; use the centralized copy config (frontend/src/content/siteCopy.ts) as the single source of truth for nav labels/targets where applicable."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Fix/restore the admin allowlist management flow so that an admin can add additional admin principals and remove admins from the Admin Panel, with clear English success/error states and immediate UI refresh after changes.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-15",
          "msg-16"
        ],
        "quotes": [
          "Where is rating thing and only 1 admin chamges",
          "Updat codss"
        ]
      },
      "acceptanceCriteria": [
        "As an admin, opening the Admin Panel shows an Admin Management area that lists current admin principals.",
        "As an admin, adding a valid principal ID succeeds and the new principal appears in the admin list without a manual page refresh.",
        "As an admin, removing an admin principal succeeds and the removed principal disappears from the list without a manual page refresh.",
        "Backend enforces admin-only access for viewing/modifying the admin list and returns clear English error messages for unauthorized access.",
        "Backend prevents removing the last remaining admin and returns a clear English error message that the UI can display."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Make admin availability and access state easier to understand for signed-in users by ensuring the header shows the correct admin entry points based on backend state: show “Set up admin access” only when and only when no admins exist yet, and show “Admin” only for admins.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-12",
          "msg-15",
          "msg-16"
        ],
        "quotes": [
          "I am not able to see any go live option here",
          "Where is rating thing and only 1 admin chamges",
          "Updat codss"
        ]
      },
      "acceptanceCriteria": [
        "When the user is signed in and the backend reports no admins exist, the header shows a “Set up admin access” button.",
        "When the backend reports admins exist, the “Set up admin access” button is not shown.",
        "When the signed-in user is an admin, the header shows an “Admin” button that opens the Admin Panel.",
        "When the signed-in user is not an admin, the header does not show the “Admin” button."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only UI components must be composed, not edited).",
    "Do not edit immutable auth/actor bootstrap hooks: frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain a single Motoko actor in backend/main.mo; introduce backend/migration.mo only if a state upgrade is required."
  ],
  "nonGoals": [
    "Adding new authentication providers beyond Internet Identity.",
    "Implementing real-time updates via WebSockets or third-party services.",
    "Changing the overall landing page section order beyond making the existing Reviews section discoverable via navigation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}