{
  "kind": "build_request",
  "title": "Make Tripple Host deployment workflow reliable so the site can be published live to IC mainnet",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-31",
      "text": "Fix and complete the deployment documentation in frontend/DEPLOYMENT.md so a developer can follow it end-to-end to publish the latest Tripple Host build to Internet Computer mainnet (IC) without missing sections or broken Markdown formatting.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Live my website nowww"
        ]
      },
      "acceptanceCriteria": [
        "frontend/DEPLOYMENT.md no longer ends abruptly and has valid Markdown (no unclosed code fences).",
        "DEPLOYMENT.md includes a complete, ordered mainnet deployment section that references the existing scripts (frontend/scripts/deploy-ic.sh and frontend/scripts/verify-deploy.sh).",
        "DEPLOYMENT.md explicitly states the expected working directory for running the scripts (or provides commands that work from the repo root).",
        "DEPLOYMENT.md includes environment setup instructions that match frontend/.env.example, including setting DFX_NETWORK=ic and II_URL=https://identity.ic0.app for mainnet."
      ]
    },
    {
      "id": "REQ-32",
      "text": "Harden the IC mainnet deployment scripts (frontend/scripts/deploy-ic.sh and frontend/scripts/verify-deploy.sh) so they are reliable to run and produce clear English output that guides the user to the live site URL.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Live my website nowww"
        ]
      },
      "acceptanceCriteria": [
        "deploy-ic.sh and verify-deploy.sh run successfully when executed as documented in DEPLOYMENT.md.",
        "If the scripts must be run from a specific directory, they detect incorrect invocation location and exit with a clear English error message explaining how to run them correctly.",
        "On success, deploy-ic.sh prints the frontend URL in the exact form https://<FRONTEND_CANISTER_ID>.ic0.app.",
        "verify-deploy.sh checks canister status and frontend HTTP accessibility (when curl is available) and exits non-zero with an English explanation when a check fails."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Ensure the live (mainnet) deployment verification checklist in documentation and/or scripts includes the critical functional smoke tests for this app (landing page loads, Internet Identity login works, admin setup claim works only when no admins exist, and admin panel opens for admins).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Live my website nowww"
        ]
      },
      "acceptanceCriteria": [
        "The documented manual verification steps explicitly include: open the deployed URL, verify no console errors on load, complete Internet Identity login/logout, claim initial admin access when no admins exist, and open the Admin Panel after admin claim.",
        "All user-facing text added/updated in docs/scripts is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend/src/components/ui (read-only shadcn components).",
    "Do not change the backend architecture (single Motoko actor in backend/main.mo).",
    "Do not introduce third-party hosting or deployment platforms; deployment must target Internet Computer mainnet via dfx."
  ],
  "nonGoals": [
    "Adding new application features unrelated to deployment.",
    "Implementing non-IC hosting (AWS/Vercel/Netlify/etc.).",
    "Changing pricing/admin/CMS behavior beyond what is required for deployment verification."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}