{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore Reviews discoverability and admin management UX",
  "requirements": [
    {
      "id": "REQ-38",
      "summary": "Add a visible \"Reviews\" navigation link (desktop + mobile) that scrolls to the existing landing-page Reviews section (#reviews) using centralized nav copy.",
      "acceptanceCriteria": [
        "On the landing page, the header navigation includes a \"Reviews\" link on desktop and in the mobile menu.",
        "Clicking the \"Reviews\" nav link scrolls/navigates to the existing Reviews section (#reviews).",
        "No user-facing navigation labels are hardcoded in Header.tsx; use the centralized copy config (frontend/src/content/siteCopy.ts) as the single source of truth for nav labels/targets where applicable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/siteCopy.ts",
          "operation": "modify",
          "description": "Add a \"Reviews\" item to the centralized nav configuration (siteCopy.nav) with id \"reviews\" so Header can render it from a single source of truth."
        },
        {
          "path": "frontend/src/components/landing/Header.tsx",
          "operation": "modify",
          "description": "Replace the hardcoded navLinks array with links derived from siteCopy.nav (including the new \"reviews\" item) so both desktop and mobile menus render the \"Reviews\" link that navigates to \"#reviews\"."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Restore reliable Admin allowlist management UI (list/add/remove) with clear success/error messaging and immediate refresh after changes.",
      "acceptanceCriteria": [
        "As an admin, opening the Admin Panel shows an Admin Management area that lists current admin principals.",
        "As an admin, adding a valid principal ID succeeds and the new principal appears in the admin list without a manual page refresh.",
        "As an admin, removing an admin principal succeeds and the removed principal disappears from the list without a manual page refresh.",
        "Backend enforces admin-only access for viewing/modifying the admin list and returns clear English error messages for unauthorized access.",
        "Backend prevents removing the last remaining admin and returns a clear English error message that the UI can display."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure admin allowlist mutations trigger an immediate UI refresh by explicitly refetching/invalidating admin-related queries after add/remove, and preserve/propagate clear English error messages that the Admin UI can display."
        },
        {
          "path": "frontend/src/components/admin/AdminsAdminPanel.tsx",
          "operation": "modify",
          "description": "Improve Admin Management UX: ensure add/remove success and error states are clear and reset appropriately, ensure the remove confirmation closes and the list reflects changes immediately, and optionally preempt last-admin removal in the UI (while still relying on backend enforcement)."
        },
        {
          "path": "frontend/src/components/admin/AdminPanel.tsx",
          "operation": "modify",
          "description": "Verify the Admin Panel continues to surface the \"Admins\" tab and the Admin Management area prominently; adjust tab labeling/placement only as needed to make the allowlist management clearly discoverable."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Make admin availability/access state obvious in the header: show “Set up admin access” only when no admins exist yet, and show “Admin” only for admins.",
      "acceptanceCriteria": [
        "When the user is signed in and the backend reports no admins exist, the header shows a “Set up admin access” button.",
        "When the backend reports admins exist, the “Set up admin access” button is not shown.",
        "When the signed-in user is an admin, the header shows an “Admin” button that opens the Admin Panel.",
        "When the signed-in user is not an admin, the header does not show the “Admin” button."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/Header.tsx",
          "operation": "modify",
          "description": "Align header admin entry points strictly with backend-derived state by verifying the conditional rendering logic for “Set up admin access” (adminsExist=false + signed-in) and “Admin” (isAdmin=true + signed-in), and ensure both desktop and mobile menus follow the same logic."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden admin-state queries (doesAdminExist/isCallerAdmin) for consistent header behavior by ensuring caching and refetch behavior updates promptly after admin bootstrap and allowlist changes."
        }
      ]
    }
  ]
}