{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Reliable IC mainnet deployment workflow for Tripple Host (docs + scripts)",
  "requirements": [
    {
      "id": "REQ-31",
      "summary": "Complete and fix frontend/DEPLOYMENT.md so developers can deploy Tripple Host to IC mainnet end-to-end using the existing scripts.",
      "acceptanceCriteria": [
        "frontend/DEPLOYMENT.md no longer ends abruptly and has valid Markdown (no unclosed code fences).",
        "DEPLOYMENT.md includes a complete, ordered mainnet deployment section that references the existing scripts (frontend/scripts/deploy-ic.sh and frontend/scripts/verify-deploy.sh).",
        "DEPLOYMENT.md explicitly states the expected working directory for running the scripts (or provides commands that work from the repo root).",
        "DEPLOYMENT.md includes environment setup instructions that match frontend/.env.example, including setting DFX_NETWORK=ic and II_URL=https://identity.ic0.app for mainnet."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Fix broken/abrupt Markdown (close any open sections/code fences) and add a complete, ordered IC mainnet deployment guide. Explicitly document the expected working directory (repo root vs frontend/) and provide commands that work as documented. Include an environment setup section aligned with frontend/.env.example, explicitly calling out DFX_NETWORK=ic and II_URL=https://identity.ic0.app for mainnet, and reference running frontend/scripts/deploy-ic.sh followed by frontend/scripts/verify-deploy.sh."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Harden IC mainnet deployment/verification scripts to be reliably runnable with clear English output and correct success/failure exit behavior.",
      "acceptanceCriteria": [
        "deploy-ic.sh and verify-deploy.sh run successfully when executed as documented in DEPLOYMENT.md.",
        "If the scripts must be run from a specific directory, they detect incorrect invocation location and exit with a clear English error message explaining how to run them correctly.",
        "On success, deploy-ic.sh prints the frontend URL in the exact form https://<FRONTEND_CANISTER_ID>.ic0.app.",
        "verify-deploy.sh checks canister status and frontend HTTP accessibility (when curl is available) and exits non-zero with an English explanation when a check fails."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/deploy-ic.sh",
          "operation": "modify",
          "description": "Make the script robust and predictable: add strict bash mode (e.g., pipefail/unset var handling), add a clear working-directory check (detect whether invoked from repo root vs frontend/ and either auto-correct paths or exit with an English message explaining the correct invocation), validate required tools (dfx, pnpm) with clear English errors, ensure dfx commands target mainnet consistently, and on success print the live frontend URL in the exact form https://<FRONTEND_CANISTER_ID>.ic0.app. Ensure all user-facing output is clear English."
        },
        {
          "path": "frontend/scripts/verify-deploy.sh",
          "operation": "modify",
          "description": "Harden verification behavior: add working-directory detection with a clear English error message when invoked incorrectly, check canister status and treat non-running status as a failure (exit non-zero with an English explanation), check frontend HTTP accessibility when curl is available and fail (exit non-zero) with an English explanation if the HTTP check does not succeed, and ensure success output clearly includes the live URL for the user to open."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Ensure documentation/scripts include a mainnet verification checklist with critical functional smoke tests (landing load, II login/logout, first-admin claim gating, admin panel access).",
      "acceptanceCriteria": [
        "The documented manual verification steps explicitly include: open the deployed URL, verify no console errors on load, complete Internet Identity login/logout, claim initial admin access when no admins exist, and open the Admin Panel after admin claim.",
        "All user-facing text added/updated in docs/scripts is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Add/replace a clear 'Post-deploy mainnet verification checklist' section that explicitly covers: opening the deployed URL, confirming no browser console errors on initial load, completing Internet Identity login and logout, confirming the initial admin claim flow is only possible when no admins exist, and opening the Admin Panel after a successful admin claim. Keep all added/updated text in English."
        },
        {
          "path": "frontend/scripts/verify-deploy.sh",
          "operation": "modify",
          "description": "Update the script's printed manual verification checklist so it includes the critical smoke tests verbatim: landing page loads, no console errors on load, Internet Identity login and logout, admin setup claim works only when no admins exist, and admin panel opens for admins. Ensure the printed guidance is clear English."
        }
      ]
    }
  ]
}