{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update landing-page CTAs: rename to PLANS and link Talk to Sales to Discord",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Rename all visible \"Start Free Trial\" CTA labels to \"PLANS\" using siteCopy as the single source of truth.",
      "acceptanceCriteria": [
        "In the hero section, the primary CTA button label displays exactly \"PLANS\".",
        "In the final CTA section (Contact section), the primary CTA button label displays exactly \"PLANS\".",
        "No other UI element still displays the exact text \"Start Free Trial\" after the change.",
        "The updated labels come from frontend/src/content/siteCopy.ts (not hardcoded in components)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/siteCopy.ts",
          "operation": "modify",
          "description": "Update siteCopy.hero.primaryCTA and siteCopy.finalCTA.primaryCTA from \"Start Free Trial\" to \"PLANS\" so all consuming components render the new label from centralized copy (no hardcoded replacements)."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Make the \"Talk to Sales\" button open the provided Discord invite in a new tab with safe external-link handling.",
      "acceptanceCriteria": [
        "Clicking the \"Talk to Sales\" button opens https://discord.gg/NMcBdXYVFe in a new tab/window.",
        "The \"Talk to Sales\" button remains visible and retains its current styling/variant (outline) and label text.",
        "The implementation uses safe external-link handling (e.g., includes noopener/noreferrer if using window.open or an anchor tag)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/landing/Sections.tsx",
          "operation": "modify",
          "description": "Update the FinalCTA \"Talk to Sales\" control to navigate to https://discord.gg/NMcBdXYVFe in a new tab using safe external-link handling (target=\"_blank\" plus rel=\"noopener noreferrer\"). Use the existing shadcn-ui Button component (outline variant) to preserve styling (e.g., via Button's anchor rendering pattern). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}